Crie o DataFrame abaixo, que representa o lucro de distintas marcas em anos de atuação de uma empresa. Use Compreensão em Listas para construir as colunas e os índices. Para constuir os valores use np.random.seed(7), de modo que os valores aleatórios sejam iguais aos definidos aqui neste exercício.


https://prnt.sc/FbAxn6Ls55G3

In [27]:
import pandas as pd

In [28]:
#dados = np.random.randint(1,50,16,).reshape((4,4))
#index = ['Ano '+str(i) for i in range(1,5)]
#col = ['Marca '+chr(65+i) for i in range(4)]
#df = pd.DataFrame(dados, columns = col, index= index )


#ou


dic = {
    'Marca A': [48, 20, 15, 47],
    'Marca B': [5, 24, 24, 43],
    'Marca C': [26, 40, 9, 27],
    'Marca D': [4, 29, 26, 9]
}
index = ['Ano 1', 'Ano 2', 'Ano 3', 'Ano 4']

df = pd.DataFrame(dic, index = index)
df

       Marca A  Marca B  Marca C  Marca D
Ano 1       48        5       26        4
Ano 2       20       24       40       29
Ano 3       15       24        9       26
Ano 4       47       43       27        9

a) acesse os seguintes atributos: columns, index, shape e values;

In [29]:
#A)
df.columns

Index(['Marca A', 'Marca B', 'Marca C', 'Marca D'], dtype='object')

In [30]:
df.index

Index(['Ano 1', 'Ano 2', 'Ano 3', 'Ano 4'], dtype='object')

In [31]:
df.shape

(4, 4)

In [32]:
df.values

array([[48,  5, 26,  4],
       [20, 24, 40, 29],
       [15, 24,  9, 26],
       [47, 43, 27,  9]], dtype=int64)

b) selecione as colunas 'Marca A' e 'Marca C', individualmente;

In [33]:
#B)
df['Marca A']

Ano 1    48
Ano 2    20
Ano 3    15
Ano 4    47
Name: Marca A, dtype: int64

In [34]:
df['Marca C']

Ano 1    26
Ano 2    40
Ano 3     9
Ano 4    27
Name: Marca C, dtype: int64

c) mostre as estatísticas descritivas de cada coluna com a função describe();

In [35]:
#C)
df.describe()

         Marca A    Marca B    Marca C    Marca D
count   4.000000   4.000000   4.000000   4.000000
mean   32.500000  24.000000  25.500000  17.000000
std    17.445152  15.513435  12.714821  12.355835
min    15.000000   5.000000   9.000000   4.000000
25%    18.750000  19.250000  21.750000   7.750000
50%    33.500000  24.000000  26.500000  17.500000
75%    47.250000  28.750000  30.250000  26.750000
max    48.000000  43.000000  40.000000  29.000000

d) mostre informações do dataset com a função info();

In [36]:
#D)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Ano 1 to Ano 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Marca A  4 non-null      int64
 1   Marca B  4 non-null      int64
 2   Marca C  4 non-null      int64
 3   Marca D  4 non-null      int64
dtypes: int64(4)
memory usage: 332.0+ bytes

e) mostre o tipo de dado de cada coluna do dataset;

In [37]:
#E)
df.dtypes

Marca A    int64
Marca B    int64
Marca C    int64
Marca D    int64
dtype: object

f) converta o data type das colunas para float;

In [38]:
#F)
df = df.astype(float)
df

       Marca A  Marca B  Marca C  Marca D
Ano 1     48.0      5.0     26.0      4.0
Ano 2     20.0     24.0     40.0     29.0
Ano 3     15.0     24.0      9.0     26.0
Ano 4     47.0     43.0     27.0      9.0

g) selecione o lucro das marcas no ano 1 (use as funções loc e iloc);

In [39]:
#G) 

df.loc['Ano 1']

Marca A    48.0
Marca B     5.0
Marca C    26.0
Marca D     4.0
Name: Ano 1, dtype: float64

In [40]:
df.iloc[0:1, :]

       Marca A  Marca B  Marca C  Marca D
Ano 1     48.0      5.0     26.0      4.0

h) selecione o lucro da Marca C nos anos 1 e 3 (use as funções loc e iloc);

In [41]:
df.loc[['Ano 1', 'Ano 3'], 'Marca C']

Ano 1    26.0
Ano 3     9.0
Name: Marca C, dtype: float64

In [42]:
df.iloc[[0, 2], 2:3]

       Marca C
Ano 1     26.0
Ano 3      9.0


i) selecione o lucro das marcas A, C e D, nos anos 2 e 4 (use as funções loc e iloc);

In [43]:
df.loc[['Ano 2', 'Ano 4'], ['Marca A', 'Marca C', 'Marca D']]

       Marca A  Marca C  Marca D
Ano 2     20.0     40.0     29.0
Ano 4     47.0     27.0      9.0

In [44]:
df.iloc[[1, 3], [0, 2, 3]]

       Marca A  Marca C  Marca D
Ano 2     20.0     40.0     29.0
Ano 4     47.0     27.0      9.0

j) mostre o lucro médio de cada marca neste intervalo temporal;

In [45]:
df.mean()

Marca A    32.5
Marca B    24.0
Marca C    25.5
Marca D    17.0
dtype: float64

l) mostre o lucro médio de todas as marcas em cada ano.

In [46]:
df.mean(axis = 1)

Ano 1    20.75
Ano 2    28.25
Ano 3    18.50
Ano 4    31.50
dtype: float64